Ran Plan for 2 projects:

1. project: `iam/dg-id` dir: `terraform/iam/dg-id` workspace: `default`
1. project: `github/terraform-provisioning` dir: `github/terraform-provisioning` workspace: `default`

### 1. project: `iam/dg-id` dir: `terraform/iam/dg-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_openid_connect_provider.gitaction_idp will be created
+ resource "aws_iam_openid_connect_provider" "gitaction_idp" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "ffffffffffffffffffffffffffffffffffffffff",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.gitaction will be created
+ resource "aws_iam_role" "gitaction" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:daegwan00/springboot-sample:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::545009828941:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gitaction"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.gitaction_ecr will be created
+ resource "aws_iam_role_policy" "gitaction_ecr" {
      + id          = (known after apply)
      + name        = "gitaction-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.gitaction_s3 will be created
+ resource "aws_iam_role_policy" "gitaction_s3" {
      + id          = (known after apply)
      + name        = "gitaction-s3"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAccessS3Bucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ gitaction_arn              = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/dg-id`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-658743340.ap-northeast-2.elb.amazonaws.com/lock?id=daegwan00%252Fterraform-provisioning%252Fterraform%252Fiam%252Fdg-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/dg-id`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. project: `github/terraform-provisioning` dir: `github/terraform-provisioning` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # github_actions_variable.example will be created
+ resource "github_actions_variable" "example" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "terraform-provisioning"
      + updated_at    = (known after apply)
      + value         = "example_variable_value"
      + variable_name = "example_variable_name"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p github/terraform-provisioning`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-658743340.ap-northeast-2.elb.amazonaws.com/lock?id=daegwan00%252Fterraform-provisioning%252Fgithub%252Fterraform-provisioning%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p github/terraform-provisioning`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
